Revit 2026 API

# ShapeImporterIsServiceAvailable Method

---

Checks whether the data conversion service and Material Library are available.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsServiceAvailable()
```
```vb
Public Shared Function IsServiceAvailable As Boolean
```
```cpp
public:
static bool IsServiceAvailable()
```
```fsharp
static member IsServiceAvailable : unit -> bool
```

#### Return Value

Boolean True if the data conversion service and Material Library are available, false otherwise.

ShapeImporter relies on optional data conversion functionality. This function checks whether it is available.

#### Reference

ShapeImporter Class

Autodesk.Revit.DB Namespace